src/Documents/КассовыйЧек/КассовыйЧек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассовыйЧек</name>
  <basedOn>Document.ПлатежноеПоручение</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипОперацииЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПлатежноеПоручение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйАттрибут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУдаленное</name>
    <type>
      <types>DocumentRef.ПлатежноеПоручение</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКвитанции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ВидОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ТипОперацииЧека/ТипОперацииЧека.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОперацииЧека</name>
  <enumValues>
    <name>sell</name>
    <comment>Sell</comment>
  </enumValues>
  <enumValues>
    <name>sell_refund</name>
    <comment>Sell refund</comment>
  </enumValues>
  <enumValues>
    <name>sell_correction</name>
    <comment>Sell correction</comment>
  </enumValues>
  <enumValues>
    <name>buy</name>
    <comment>Buy</comment>
  </enumValues>
  <enumValues>
    <name>buy_refund</name>
    <comment>Buy refund</comment>
  </enumValues>
  <enumValues>
    <name>buy_correction</name>
    <comment>Buy correction</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидОплаты/ВидОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОплаты</name>
  <enumValues>
    <name>ЭлектронныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
</mdclass:Enum>

src/Documents/КассовыйЧек/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
//
//
//
//


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипОперации =  enums.ТипОперацииЧека.sell;
	
	//контроль не делаем: если руками то не наше дело, 
	// если программно за них отвечает запускающая обработка
	if typeOf(ДанныеЗаполнения) = type("DocumentRef.ПлатежноеПоручение") then
		КонтрольнаяСумма  = ДанныеЗаполнения.Сумма;
		Контрагент  =       ДанныеЗаполнения.Плательщик;
		Основание   =       ДанныеЗаполнения;
		
		//if  ValueIsFilled(ДанныеЗаполнения.Договор) 
		//	and ДанныеЗаполнения.Договор.Квитанции.Count()>0 then
		//	
		//	aSumm    = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеЗаполнения.Сумма,    ДанныеЗаполнения.Договор.Квитанции.UnloadColumn("Сумма"),2); 
		//	aSummNDS = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеЗаполнения.СуммаНДС, ДанныеЗаполнения.Договор.Квитанции.UnloadColumn("Сумма"),2); 
		//	
		//	Товары.Clear();
		//	for each rowC in ДанныеЗаполнения.Договор.Квитанции do	
		//		newRow = Товары.Add();
		//		newRow.Услуга = rowC.Услуга;
		//		newRow.ВидОплаты = enums.ВидОплаты.ЭлектронныйПлатеж;
		//		newRow.Сумма     = aSumm[idx];
		//		if aSummNDS<>undefined then
		//			newRow.СуммаНДС  = aSummNDS[idx];
		//		endIf;
		//		idx = idx + 1;
		//	endDo;
		//endif;	
	endif;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	if ОбменДанными.Загрузка then
		return;
	endif;
	
	Summ = 0;
	for each row in Товары do
		if not ValueIsFilled(row.ВидОплаты) then
			row.ВидОплаты = enums.ВидОплаты.ЭлектронныйПлатеж;
		endif;	
		Summ = Summ + row.Сумма;
	endDo;
	
	//if КонтрольнаяСумма = 0 then
	//	КонтрольнаяСумма = Summ;
	//endif;
	
	//Основание используеться для связки чека и платежки
	if DeletionMark then
		
		if Обработан and not Ref.DeletionMark then
			Отказ = true;
			return;
		endif;	
		
		ОснованиеУдаленное = Основание;
		Основание = undefined;
	else
		if not ValueIsFilled(Основание) then
			Основание = ОснованиеУдаленное;
		endif;	
	endif;	
	
КонецПроцедуры
